Ran Plan for project: `staging` dir: `terraform` workspace: `staging`

<details><summary>Show Output</summary>

```diff
+---------+---------------------------------------------------------------------------------------------+-----------+---------+
| RESULT  |                                            FILE                                             | NAMESPACE | MESSAGE |
+---------+---------------------------------------------------------------------------------------------+-----------+---------+
| success | /atlantis-data/repos/leandromoreirati/demo-pgsql-backstage/1/staging/terraform/outputs.tf   | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/demo-pgsql-backstage/1/staging/terraform/providers.tf | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/demo-pgsql-backstage/1/staging/terraform/variables.tf | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/demo-pgsql-backstage/1/staging/terraform/versions.tf  | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/demo-pgsql-backstage/1/staging/terraform/backend.tf   | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/demo-pgsql-backstage/1/staging/terraform/data.tf      | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/demo-pgsql-backstage/1/staging/terraform/main.tf      | main      | SUCCESS |
+---------+---------------------------------------------------------------------------------------------+-----------+---------+


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.postgresql.azurerm_postgresql_flexible_server.default["demo-pgsql-backstage"] will be created
+ resource "azurerm_postgresql_flexible_server" "default" {
+       administrator_login           = "psqladmin"
+       administrator_password        = (sensitive value)
+       auto_grow_enabled             = false
+       backup_retention_days         = (known after apply)
+       fqdn                          = (known after apply)
+       geo_redundant_backup_enabled  = false
+       id                            = (known after apply)
+       location                      = "eastus2"
+       name                          = "demo-pgsql-backstage"
+       private_dns_zone_id           = (known after apply)
+       public_network_access_enabled = false
+       resource_group_name           = "rg-demo"
+       sku_name                      = "GP_Standard_D4ds_v4"
+       storage_mb                    = 32768
+       storage_tier                  = "P30"
+       tags                          = {
+           "terraform" = "true"
        }
+       version                       = "14"
+       zone                          = "1"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_configuration.default["demo-pgsql-backstage"] will be created
+ resource "azurerm_postgresql_flexible_server_configuration" "default" {
+       id        = (known after apply)
+       name      = "azure.extensions"
+       server_id = (known after apply)
+       value     = "CUBE,CITEXT,BTREE_GIST"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_database.default["my-database"] will be created
+ resource "azurerm_postgresql_flexible_server_database" "default" {
+       charset   = "UTF8"
+       collation = "en_US.utf8"
+       id        = (known after apply)
+       name      = "my-database"
+       server_id = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
! pgsq_fqdn                          = "demo-pgsql-backstage.postgres.database.azure.com" -> (known after apply)
! pgsq_id                            = "/subscriptions/a4569fe6-ace1-4216-8b6c-ba25ed31353f/resourceGroups/rg-demo/providers/Microsoft.DBforPostgreSQL/flexibleServers/demo-pgsql-backstage" -> (known after apply)

Generating Infracost cost estimates for terraform/staging...

+ infracost breakdown '--path=/atlantis-data/repos/leandromoreirati/demo-pgsql-backstage/1/staging/terraform/staging-staging.json' '--format=json' '--log-level=debug' '--out-file=/tmp/leandromoreirati-demo-pgsql-backstage-1/staging-terraform-infracost.json' --no-color
2025-02-20T18:24:17Z DEBUG IsCloudEnabled inferred from Config.EnabledDashboard is_cloud_enabled=false
2025-02-20T18:24:17Z DEBUG 'POST' request to '/graphql' using trace_id: '8586a184-fdb3-4a44-904b-f4d47e72ca3f'
2025-02-20T18:24:17Z DEBUG performing request method POST url https://dashboard.api.infracost.io/graphql library=retryablehttp
2025-02-20T18:24:18Z DEBUG Successfully loaded settings from Infracost Cloud result="{CloudEnabled:false ActualCostsEnabled:false UsageAPIEnabled:false TagsAPIEnabled:false PoliciesAPIEnabled:false}"
2025-02-20T18:24:18Z DEBUG 'POST' request to '/graphql' using trace_id: '8586a184-fdb3-4a44-904b-f4d47e72ca3f'
2025-02-20T18:24:18Z DEBUG performing request method POST url https://pricing.api.infracost.io/graphql library=retryablehttp
2025-02-20T18:24:18Z DEBUG os env 'ATLANTIS_REPO_ALLOWLIST=github.com/leandromoreirati/*' matched prefix 'ATLANTIS_'
2025-02-20T18:24:18Z DEBUG fetching Atlantis VCS metadata
2025-02-20T18:24:18Z DEBUG could not get local git file changes, failed to get the previous commit to compare the current commit against, this is likely because of a shallow clone in CI error=EOF
2025-02-20T18:24:18Z INFO Autodetected 1 Terraform plan JSON file project across 1 root module
2025-02-20T18:24:18Z INFO Found Terraform plan JSON file project "-atlantis-data-repos-leandromoreirati-demo-pgsql-backstage-1-staging-terraform-staging-staging.json" at directory "/atlantis-data/repos/leandromoreirati/demo-pgsql-backstage/1/staging/terraform/staging-staging.json"
2025-02-20T18:24:18Z DEBUG Starting evaluation for project "-atlantis-data-repos-leandromoreirati-demo-pgsql-backstage-1-staging-terraform-staging-staging.json"
2025-02-20T18:24:18Z DEBUG IsCloudEnabled inferred from Config.EnabledDashboard is_cloud_enabled=false
2025-02-20T18:24:18Z DEBUG Unsupported provider terraform
2025-02-20T18:24:18Z DEBUG Unsupported provider terraform
2025-02-20T18:24:18Z DEBUG Unsupported provider terraform
2025-02-20T18:24:18Z DEBUG Retrieving cloud prices to calculate costs
2025-02-20T18:24:18Z DEBUG Getting pricing details for 3 cost components from https://pricing.api.infracost.io
2025-02-20T18:24:18Z DEBUG 'POST' request to '/graphql' using trace_id: '8586a184-fdb3-4a44-904b-f4d47e72ca3f'
2025-02-20T18:24:18Z DEBUG performing request method POST url https://pricing.api.infracost.io/graphql library=retryablehttp
2025-02-20T18:24:18Z DEBUG Skipping free resource module.postgresql.azurerm_postgresql_flexible_server_database.default["my-database"]
2025-02-20T18:24:18Z DEBUG Skipping free resource module.postgresql.azurerm_postgresql_flexible_server_configuration.default["demo-pgsql-backstage"]
2025-02-20T18:24:18Z DEBUG Finished evaluation for project "-atlantis-data-repos-leandromoreirati-demo-pgsql-backstage-1-staging-terraform-staging-staging.json"
2025-02-20T18:24:18Z DEBUG IsCloudEnabled inferred from Config.EnabledDashboard is_cloud_enabled=false
2025-02-20T18:24:18Z DEBUG Skipping sending project results since Infracost Cloud upload is not enabled.
2025-02-20T18:24:18Z DEBUG 'POST' request to '/event' using trace_id: '8586a184-fdb3-4a44-904b-f4d47e72ca3f'
2025-02-20T18:24:18Z DEBUG performing request method POST url https://pricing.api.infracost.io/event library=retryablehttp
2025-02-20T18:24:18Z INFO Output saved to /tmp/leandromoreirati-demo-pgsql-backstage-1/staging-terraform-infracost.json

Update: A new version of Infracost is available: v0.10.37 → v0.10.40
  $ curl -fsSL https://raw.githubusercontent.com/infracost/infracost/master/scripts/install.sh | sh
2025-02-20T18:24:18Z DEBUG writing 0 objects to filesystem cache
2025-02-20T18:24:18Z DEBUG could not flush pricing API cache to filesystem error="open /atlantis-data/repos/leandromoreirati/demo-pgsql-backstage/1/staging/terraform/staging-staging.json/.infracost/pricing.gob: not a directory"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p staging
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://172.212.4.252/lock?id=leandromoreirati%252Fdemo-pgsql-backstage%252Fterraform%252Fstaging)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p staging
  ```
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```